{
    "sidebar": {
        "fullName": "Роман Пелля",
        "designed": "Создано",
        "home": "Главная",
        "about": "Обо мне",
        "skills": "Навыки",
        "resume": "Резюме",
        "contact": "Контакты"
    },
    "home": {
        "title": "Роман Пелля",
        "subTitle": "Я"
    },
    "about": {
        "title": "Обо мне",
        "description": "Меня зовут Роман Пелля, я живу в России и работаю Frontend-разработчиком. Моя карьера характеризуется постоянным профессиональным ростом и успешной реализацией ряда проектов. Некоторые из моих достижений перечислены ниже.",
        "header": "Frontend веб разработчик",
        "subHeader": "Я опытный фронтенд-разработчик, владеющий современными веб-технологиями. Хорошо разбираюсь в принципах веб-разработки и передовых методах и стремлюсь создавать высококачественные, удобные для пользователей веб-приложения.",
        "info": {
            "birthday": {
                "label": "Дата рождения",
                "value": "11 мая"
            },
            "email": {
                "label": "Электронная почта",
                "value": "rpellya@gmail.com"
            },
            "city": {
                "label": "Город",
                "value": "Санкт-Петербург, Россия"
            },
            "education": {
                "label": "Образование",
                "value": "Прикладная информатика, СПБПУ"
            }
        }
    },
    "skills": {
        "title": "Навыки",
        "subtitle": "Основные:",
        "description": "Я занимаюсь созданием информационных систем в области информационной безопасности. Имею опыт разработки административных панелей для крупных продуктов на React, а также опыт руководство группой разработки и наставничества.",
        "addSkills": "Дополнительные:"
    },
    "resume": {
        "title": "Резюме",
        "description": "Я стремлюсь занять позицию middle+, senior frontend-разработчика. Всегда открыт для новых возможностей, готов повышать свои навыки и применять на практике. Готов взять на себя ответственность за сложные задачи и внести вклад в создание качественных продуктов.",
        "download": {
            "text": "Вы можете скачать моё резюме",
            "here": "здесь"
        },
        "sumary": {
            "title": "Краткое содержание",
            "subTitle": "Роман Пелля",
            "description": "Легко устанавливаю контакт и создаю продуктивные взаимоотношения с коллегами и партнерами. Глубоко анализирую проблемы, нахожу решения даже в условиях ограниченных ресурсов или сроков. Точно соблюдаю дедлайны благодаря детальному планированию и приоритизации задач, ответственно их выполняю. Воспринимаю сложные проекты как вызов для профессионального роста! Постоянно изучаю современные инструменты и оптимизирую процессы.",
            "city": "Санкт-Петербург, Россия"
        },
        "experience": {
            "title": "Профессиональный опыт",
            "subTitle": "Frontend-разработчик",
            "years": "2023 - Сейчас",
            "place": "Датаджайл, Россия",
            "description": "Разработка SPA-приложений для административных панелей в сфере информационной безопасности. Технологии: React.js, JS, TS, HTML, Styles Components, SCSS, Redux Toolkit, Webpack, Vite, Ant design, Jest, React Testing Library, StoryBook, Git.",
            "labels": {
                "0": "Создание и поддержка высоконагруженных административных панелей для управления крупными продуктами с нуля.",
                "1": "Настройка сборщиков Webpack и Vite, окружения для тестирования, линтеры ESLint, StyleLint, Prettier.",
                "2": "Проектирования бизнес-логики и архитектуры приложения.",
                "3": "Реализация бизнес-логики с использованием RTK Query.",
                "4": "Разрботка различных модулей и компонентов: отдельная ui-библиотека под каждый проект, регистрация и авторизация пользователя с использованием JWT токенов, идентификация сотрудника.",
                "5": "Оптимизация проектов. В ходе рефакторинга использовал «ленивую» подгрузку компонентов и переводов, что увеличило скорость работы приложения на 30%, сокращение времени сборки на 40% через насройку сборщиков.",
                "6": "Построение больших SVG-графиков и обновление их каждую секунду без утечки памяти.",
                "7": "Проведение код-ревью и наставничество junior-разработчиков.",
                "8": "Внедрение лучших практик (code style, типизация, документация требований к полям).",
                "9": "Доведение покрытия кода тестами до 80% для критически важных модулей.",
                "10": "Настройка unit-тестов (Jest, React Testing Library) и StoryBook для ui-бибилотек.",
                "11": "Принимал участие в 3 больших и тяжелых проекта на React.ts."
            }
        },
        "education": {
            "title": "Образование",
            "university": {
                "subTitle": "Санкт-Петербургский политехнический университет Петра Великого (СПбПУ)",
                "years": "2024 - Сейчас",
                "place": "Санкт-Петербург, Россия",
                "description": "09.03.03. Прикладная инфорамтика"
            },
            "yandexPracticum": {
                "subTitle": "Курс «Мидл фронтенд‑разработчик»",
                "years": "2025",
                "place": "Яндекс Практикум, Онлайн",
                "description": "Дополнительное образование для повышения квалификации"
            },
            "ulbi": {
                "subTitle": "Продвинутый Frontend. В production на React",
                "years": "2024",
                "place": "ulbitv, Онлайн",
                "description": "Дополнительное образование для повышения квалификации"
            },
            "college": {
                "subTitle": "Институт среднего профессионального образования им. Петра Великого",
                "years": "2020 - 2024",
                "place": "Санкт-Петербург, Россия",
                "description": "09.02.07. Программирование и информационные технологии"
            }
        }
    },
    "contact": {
        "title": "Контакты",
        "description": "Вы можете связаться со мной через различные социальные сети или написать мне напрямую по адресу rpellya@gmail.com",
        "socials": {
            "github": "GitHub",
            "telegram": "Телеграм",
            "email": "Электронная почта",
            "youtube": "YouTube"
        }
    }
}
